Autodesk.Revit.DB.PaperSource.Name
Retrieve the paper source name of current project.

Autodesk.Revit.DB.PaperSource
An object that represents a Paper Source of Print Setup within the Autodesk Revit project.
Remarks: This object derived from the APIObject base object.